系统默认提供的6个基本数据类型
#1,  Munber    数值类型
           int   整型       0~9组成的所有数
           
           float   浮点型   a = 1.1111111
           
           bool     布尔型
                    # True   表示肯定
                    # False   表示否定
           
           complex   复数 
                     #虚数(j)
                     #  a = 1+2j 

#2,  String    字符类型
                      ""
                      ''
                      """  """ 可以换行输出 注释用的多

                
#3,  List      列表类型
                       一系列数据的顺序组合 并且可以修改  标示符号[]
#4,  tuple      元组类型
                       一系列数据的顺序组合 并且不能修改   标示符号,,
#5， dict       字典类型
                        键值映射关系的无序组合标示符号{}
                        
#6,   set       集合类型
                        一组特定数据  无序集合  所有数据不会重复 没标识符
                        空集合 a = set()



\ 表示转义   把后面的字母转换成特殊含义的
r 表示元字符
type()    查看一个变量的数据类型
