#值value
#键key      key键只能是唯一 
#字典里键值 一一对应   存在映射关系    
#给定两个列表
brand = ['李宁','元歌','婉儿','耐克']
slogan = ['一切皆有可能','1433223','233333','Just do it']
print('元歌的口号是',slogan[brand.index('元歌')])
#---------创建一个字典--------{}大括号  键值一一对应  用冒号隔开
dict1 = {'李宁':'一切皆有可能','元歌':'1433223','婉儿':'233333','耐克':'Just do it'}
print('元歌的口号是',dict1['元歌'])
#----------创建一个字典-----
dict2 = {1:'one',2:'two',3:'three'}
#---------创建一个空字典----------
dict3 = {}
#---------利用dict工厂函数创建字典-----
dict4 = dict(元歌='1433223',婉儿='233333')
print(dict4)
#-----------可以利用键值关系改变数据-----------键存在字典里的------
dict4['婉儿'] = '梁祝'
print(dict4['婉儿'])
#---------不存在字典里-----
dict4['爱迪生'] = '天才需要99%的汗水'
print(dict4['爱迪生'])
#----------feomkeys可以访问并创建一个新的字典----
dict5 = {}
dict5.fromkeys((1,2,3))
#--------这里想一次性修改对应的值   他会将后面小括号内的所有当做一个值对待
dict6 = dict5.fromkeys((1,2,3),('one','two','three'))
print(dict6)
